
**Terraform Cloud Plan Output**



<details><summary>Show Plan(infra/aws/prod)</summary>

```

[command]/home/runner/work/_temp/95bed2a6-40a7-49d7-8911-54fea2d071b5/terraform-bin plan -no-color
2024-05-21T16:09:57.376Z [INFO]  Terraform version: 1.8.1
2024-05-21T16:09:57.377Z [INFO]  Go runtime version: go1.22.1
2024-05-21T16:09:57.377Z [INFO]  CLI args: []string{"/home/runner/work/_temp/95bed2a6-40a7-49d7-8911-54fea2d071b5/terraform-bin", "plan", "-no-color"}
2024-05-21T16:09:57.377Z [INFO]  CLI command args: []string{"plan", "-no-color"}
2024-05-21T16:09:57.383Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=fce1b558-7cc1-5cf9-7971-170fe49a7aa6 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials
2024-05-21T16:09:58.121Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=fce1b558-7cc1-5cf9-7971-170fe49a7aa6 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-21T16:09:58.304Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=fce1b558-7cc1-5cf9-7971-170fe49a7aa6 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-21T16:09:58.640Z [INFO]  backend/local: starting Plan operation
2024-05-21T16:09:59.256Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=802ff5fa-4b68-6d0a-6fc3-b6900da71001 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-21T16:09:59.638Z [INFO]  provider: configuring client automatic mTLS
2024-05-21T16:09:59.733Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-21T16:09:59.733Z
2024-05-21T16:10:00.373Z [INFO]  provider: configuring client automatic mTLS
2024-05-21T16:10:00.465Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-21T16:10:00.465Z
2024-05-21T16:10:00.588Z [INFO]  backend/local: plan calling Plan
2024-05-21T16:10:00.595Z [INFO]  provider: configuring client automatic mTLS
2024-05-21T16:10:00.682Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-21T16:10:00.682Z
2024-05-21T16:10:00.793Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved credentials: tf_aws.credentials_source=EnvConfigCredentials tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 @module=aws.aws-base tf_req_id=3cdaaa79-5f7b-9480-0ebf-ef7fb6d0132d tf_rpc=ConfigureProvider timestamp=2024-05-21T16:10:00.793Z
2024-05-21T16:10:01.508Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved caller identity from STS: tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 @module=aws.aws-base tf_req_id=3cdaaa79-5f7b-9480-0ebf-ef7fb6d0132d tf_rpc=ConfigureProvider timestamp=2024-05-21T16:10:01.508Z
aws_iam_role_policy_attachment.asg_policy_attachment: Refreshing state... [id=algosolved-lambda-role-20240514145856309600000001]
data.aws_ami.ubuntu: Reading...
aws_iam_role_policy_attachment.rds_policy_attachment: Refreshing state... [id=algosolved-lambda-role-20240514145946165200000001]
aws_iam_role.lambda_role: Refreshing state... [id=algosolved-lambda-role]
aws_iam_policy.asg_management_policy: Refreshing state... [id=arn:aws:iam::471112990651:policy/autoscaling-management-policy]
aws_iam_policy.rds_management_policy: Refreshing state... [id=arn:aws:iam::471112990651:policy/rds-management-policy]
aws_ecr_repository.algosolved_repository: Refreshing state... [id=algosolved-ecr]
aws_security_group.algosolved-ec2-sg: Refreshing state... [id=sg-00c0a6b6c9e473ec0]
2024-05-21T16:10:01.523Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lb_target_group.algosolved-lb-tg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .lambda_multi_value_headers_enabled: planned value cty.False for a non-computed attribute
      - .target_type: planned value cty.StringVal("instance") for a non-computed attribute
      - .proxy_protocol_v2: planned value cty.False for a non-computed attribute
      - .slow_start: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .health_check[0].enabled: planned value cty.True for a non-computed attribute
      - .health_check[0].protocol: planned value cty.StringVal("HTTP") for a non-computed attribute
      - .stickiness: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .target_failover: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
      - .target_health_state: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-05-21T16:10:01.757Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_policy.rds_management_policy during refresh.
      - .attachment_count: was cty.NumberIntVal(0), but now cty.NumberIntVal(1)
2024-05-21T16:10:01.762Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_policy.asg_management_policy during refresh.
      - .attachment_count: was cty.NumberIntVal(0), but now cty.NumberIntVal(1)
2024-05-21T16:10:01.792Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_role.lambda_role during refresh.
      - .managed_policy_arns: actual set element cty.StringVal("arn:aws:iam::471112990651:policy/rds-management-policy") does not correlate with any element in plan
      - .managed_policy_arns: length changed from 1 to 2
2024-05-21T16:10:02.369Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-ec2-sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
2024-05-21T16:10:02.373Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lb.algosolved-lb, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .preserve_host_header: planned value cty.False for a non-computed attribute
      - .enable_deletion_protection: planned value cty.False for a non-computed attribute
      - .client_keep_alive: planned value cty.NumberIntVal(3600) for a non-computed attribute
      - .enable_http2: planned value cty.True for a non-computed attribute
      - .enable_tls_version_and_cipher_suite_headers: planned value cty.False for a non-computed attribute
      - .enable_waf_fail_open: planned value cty.False for a non-computed attribute
      - .xff_header_processing_mode: planned value cty.StringVal("append") for a non-computed attribute
      - .desync_mitigation_mode: planned value cty.StringVal("defensive") for a non-computed attribute
      - .enable_xff_client_port: planned value cty.False for a non-computed attribute
      - .drop_invalid_header_fields: planned value cty.False for a non-computed attribute
      - .subnet_mapping: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-05-21T16:10:02.380Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_alb_listener.algosolved-https-listener, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .mutual_authentication: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-05-21T16:10:02.381Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_alb_listener.algosolved-http-forward, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .default_action[0].redirect[0].host: planned value cty.StringVal("#{host}") for a non-computed attribute
      - .default_action[0].redirect[0].path: planned value cty.StringVal("/#{path}") for a non-computed attribute
      - .default_action[0].redirect[0].query: planned value cty.StringVal("#{query}") for a non-computed attribute
      - .mutual_authentication: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-05-21T16:10:02.554Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_ecr_repository.algosolved_repository during refresh.
      - .tags: was null, but now cty.MapValEmpty(cty.String)
2024-05-21T16:10:02.556Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .encryption_configuration: block count in plan (1) disagrees with count in config (0)
      - .image_scanning_configuration: block count in plan (1) disagrees with count in config (0)
data.aws_ami.ubuntu: Read complete after 1s [id=ami-00dade17b7cbec931]
aws_launch_template.algosolved-lt: Refreshing state... [id=lt-040a43fee0df84a02]
2024-05-21T16:10:03.203Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_launch_template.algosolved-lt during refresh.
      - .security_group_names: was null, but now cty.SetValEmpty(cty.String)
2024-05-21T16:10:03.212Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_launch_template.algosolved-lt, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .disable_api_termination: planned value cty.False for a non-computed attribute
      - .instance_initiated_shutdown_behavior: planned value cty.StringVal("") for a non-computed attribute
      - .ram_disk_id: planned value cty.StringVal("") for a non-computed attribute
      - .user_data: planned value cty.StringVal("") for a non-computed attribute
      - .ebs_optimized: planned value cty.StringVal("") for a non-computed attribute
      - .security_group_names: planned value cty.SetValEmpty(cty.String) for a non-computed attribute
      - .disable_api_stop: planned value cty.False for a non-computed attribute
      - .kernel_id: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].virtual_name: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].no_device: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].ebs[0].delete_on_termination: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].ebs[0].encrypted: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].ebs[0].kms_key_id: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].ebs[0].snapshot_id: planned value cty.StringVal("") for a non-computed attribute
aws_autoscaling_group.algosolved-ec2-asg: Refreshing state... [id=algosolved-ec2-asg]
2024-05-21T16:10:04.077Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_autoscaling_group.algosolved-ec2-asg during refresh.
      - .enabled_metrics: was null, but now cty.SetValEmpty(cty.String)
      - .suspended_processes: was null, but now cty.SetValEmpty(cty.String)
      - .termination_policies: was null, but now cty.ListValEmpty(cty.String)
2024-05-21T16:10:04.086Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_autoscaling_group.algosolved-ec2-asg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .termination_policies: planned value cty.ListValEmpty(cty.String) for a non-computed attribute
      - .health_check_grace_period: planned value cty.NumberIntVal(300) for a non-computed attribute
      - .launch_configuration: planned value cty.StringVal("") for a non-computed attribute
      - .suspended_processes: planned value cty.SetValEmpty(cty.String) for a non-computed attribute
      - .target_group_arns: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)}) nor prior value cty.SetValEmpty(cty.String)
      - .default_instance_warmup: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .placement_group: planned value cty.StringVal("") for a non-computed attribute
      - .context: planned value cty.StringVal("") for a non-computed attribute
      - .capacity_rebalance: planned value cty.False for a non-computed attribute
      - .max_instance_lifetime: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .protect_from_scale_in: planned value cty.False for a non-computed attribute
      - .enabled_metrics: planned value cty.SetValEmpty(cty.String) for a non-computed attribute
      - .metrics_granularity: planned value cty.StringVal("1Minute") for a non-computed attribute
      - .wait_for_capacity_timeout: planned value cty.StringVal("10m") for a non-computed attribute
      - .desired_capacity_type: planned value cty.StringVal("") for a non-computed attribute
      - .force_delete: planned value cty.False for a non-computed attribute
      - .force_delete_warm_pool: planned value cty.False for a non-computed attribute
      - .ignore_failed_scaling_activities: planned value cty.False for a non-computed attribute
2024-05-21T16:10:04.100Z [INFO]  backend/local: plan operation completed

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_alb_listener.algosolved-http-forward will be created
  + resource "aws_alb_listener" "algosolved-http-forward" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + tags_all          = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_alb_listener.algosolved-https-listener will be created
  + resource "aws_alb_listener" "algosolved-https-listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS-1-2-2017-01"
      + tags              = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + tags_all          = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + timeouts {}
    }

  # aws_autoscaling_group.algosolved-ec2-asg will be updated in-place
  ~ resource "aws_autoscaling_group" "algosolved-ec2-asg" {
        id                               = "algosolved-ec2-asg"
        name                             = "algosolved-ec2-asg"
      ~ target_group_arns                = [] -> (known after apply)
        # (30 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecr_repository.algosolved_repository will be updated in-place
  ~ resource "aws_ecr_repository" "algosolved_repository" {
        id                   = "algosolved-ecr"
        name                 = "algosolved-ecr"
        tags                 = {}
      ~ tags_all             = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_iam_policy.asg_management_policy will be destroyed
  # (because aws_iam_policy.asg_management_policy is not in configuration)
  - resource "aws_iam_policy" "asg_management_policy" {
      - arn              = "arn:aws:iam::471112990651:policy/autoscaling-management-policy" -> null
      - attachment_count = 1 -> null
      - description      = "Policy to manage AutoScaling groups" -> null
      - id               = "arn:aws:iam::471112990651:policy/autoscaling-management-policy" -> null
      - name             = "autoscaling-management-policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:UpdateAutoScalingGroup"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAW3MEFX65WIL4NBCRH" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_policy.rds_management_policy will be destroyed
  # (because aws_iam_policy.rds_management_policy is not in configuration)
  - resource "aws_iam_policy" "rds_management_policy" {
      - arn              = "arn:aws:iam::471112990651:policy/rds-management-policy" -> null
      - attachment_count = 1 -> null
      - description      = "Policy to manage RDS instances" -> null
      - id               = "arn:aws:iam::471112990651:policy/rds-management-policy" -> null
      - name             = "rds-management-policy" -> null
      - path             = "/" -> null
      - policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "rds:DescribeDBInstances",
                          - "rds: StopDBInstance",
                          - "rds: StartDBInstance",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id        = "ANPAW3MEFX652XFQDBRBG" -> null
      - tags             = {} -> null
      - tags_all         = {} -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role.lambda_role will be destroyed
  # (because aws_iam_role.lambda_role is not in configuration)
  - resource "aws_iam_role" "lambda_role" {
      - arn                   = "arn:aws:iam::471112990651:role/algosolved-lambda-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-05-14T14:58:10Z" -> null
      - force_detach_policies = false -> null
      - id                    = "algosolved-lambda-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::471112990651:policy/autoscaling-management-policy",
          - "arn:aws:iam::471112990651:policy/rds-management-policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "algosolved-lambda-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAW3MEFX65ZT3NCLPLA" -> null
        # (3 unchanged attributes hidden)
    }

  # aws_iam_role_policy_attachment.asg_policy_attachment will be destroyed
  # (because aws_iam_role_policy_attachment.asg_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "asg_policy_attachment" {
      - id         = "algosolved-lambda-role-20240514145856309600000001" -> null
      - policy_arn = "arn:aws:iam::471112990651:policy/autoscaling-management-policy" -> null
      - role       = "algosolved-lambda-role" -> null
    }

  # aws_iam_role_policy_attachment.rds_policy_attachment will be destroyed
  # (because aws_iam_role_policy_attachment.rds_policy_attachment is not in configuration)
  - resource "aws_iam_role_policy_attachment" "rds_policy_attachment" {
      - id         = "algosolved-lambda-role-20240514145946165200000001" -> null
      - policy_arn = "arn:aws:iam::471112990651:policy/rds-management-policy" -> null
      - role       = "algosolved-lambda-role" -> null
    }

  # aws_lb.algosolved-lb will be created
  + resource "aws_lb" "algosolved-lb" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 120
      + internal                                                     = (known after apply)
      + ip_address_type                                              = "ipv4"
      + load_balancer_type                                           = "application"
      + name                                                         = "algosolved-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-00c0a6b6c9e473ec0",
        ]
      + subnets                                                      = [
          + "subnet-02a53b7890c322346",
          + "subnet-048b8c0b0d0c912b2",
          + "subnet-05c85f1be65b09802",
          + "subnet-06c7c601881a79996",
        ]
      + tags                                                         = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + tags_all                                                     = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + timeouts {}
    }

  # aws_lb_target_group.algosolved-lb-tg will be created
  + resource "aws_lb_target_group" "algosolved-lb-tg" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "15"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "algosolved-ec2-target-group"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + tags_all                           = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0f87a26ea18c1b807"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/api/health/ping"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 10
        }
    }

Plan: 4 to add, 2 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: aws_iam_role_policy_attachment.asg_policy_attachment: Refreshing state... [id=algosolved-lambda-role-20240514145856309600000001]%0Adata.aws_ami.ubuntu: Reading...%0Aaws_iam_role_policy_attachment.rds_policy_attachment: Refreshing state... [id=algosolved-lambda-role-20240514145946165200000001]%0Aaws_iam_role.lambda_role: Refreshing state... [id=algosolved-lambda-role]%0Aaws_iam_policy.asg_management_policy: Refreshing state... [id=arn:aws:iam::471112990651:policy/autoscaling-management-policy]%0Aaws_iam_policy.rds_management_policy: Refreshing state... [id=arn:aws:iam::471112990651:policy/rds-management-policy]%0Aaws_ecr_repository.algosolved_repository: Refreshing state... [id=algosolved-ecr]%0Aaws_security_group.algosolved-ec2-sg: Refreshing state... [id=sg-00c0a6b6c9e473ec0]%0Adata.aws_ami.ubuntu: Read complete after 1s [id=ami-00dade17b7cbec931]%0Aaws_launch_template.algosolved-lt: Refreshing state... [id=lt-040a43fee0df84a02]%0Aaws_autoscaling_group.algosolved-ec2-asg: Refreshing state... [id=algosolved-ec2-asg]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # aws_alb_listener.algosolved-http-forward will be created%0A  + resource "aws_alb_listener" "algosolved-http-forward" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + load_balancer_arn = (known after apply)%0A      + port              = 80%0A      + protocol          = "HTTP"%0A      + ssl_policy        = (known after apply)%0A      + tags              = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all          = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A%0A      + default_action {%0A          + order = (known after apply)%0A          + type  = "redirect"%0A%0A          + redirect {%0A              + host        = "#{host}"%0A              + path        = "/#{path}"%0A              + port        = "443"%0A              + protocol    = "HTTPS"%0A              + query       = "#{query}"%0A              + status_code = "HTTP_301"%0A            }%0A        }%0A    }%0A%0A  # aws_alb_listener.algosolved-https-listener will be created%0A  + resource "aws_alb_listener" "algosolved-https-listener" {%0A      + arn               = (known after apply)%0A      + id                = (known after apply)%0A      + load_balancer_arn = (known after apply)%0A      + port              = 443%0A      + protocol          = "HTTPS"%0A      + ssl_policy        = "ELBSecurityPolicy-TLS-1-2-2017-01"%0A      + tags              = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all          = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A%0A      + timeouts {}%0A    }%0A%0A  # aws_autoscaling_group.algosolved-ec2-asg will be updated in-place%0A  ~ resource "aws_autoscaling_group" "algosolved-ec2-asg" {%0A        id                               = "algosolved-ec2-asg"%0A        name                             = "algosolved-ec2-asg"%0A      ~ target_group_arns                = [] -> (known after apply)%0A        # (30 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # aws_ecr_repository.algosolved_repository will be updated in-place%0A  ~ resource "aws_ecr_repository" "algosolved_repository" {%0A        id                   = "algosolved-ecr"%0A        name                 = "algosolved-ecr"%0A        tags                 = {}%0A      ~ tags_all             = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A        # (4 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # aws_iam_policy.asg_management_policy will be destroyed%0A  # (because aws_iam_policy.asg_management_policy is not in configuration)%0A  - resource "aws_iam_policy" "asg_management_policy" {%0A      - arn              = "arn:aws:iam::471112990651:policy/autoscaling-management-policy" -> null%0A      - attachment_count = 1 -> null%0A      - description      = "Policy to manage AutoScaling groups" -> null%0A      - id               = "arn:aws:iam::471112990651:policy/autoscaling-management-policy" -> null%0A      - name             = "autoscaling-management-policy" -> null%0A      - path             = "/" -> null%0A      - policy           = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action   = "autoscaling:UpdateAutoScalingGroup"%0A                      - Effect   = "Allow"%0A                      - Resource = "*"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - policy_id        = "ANPAW3MEFX65WIL4NBCRH" -> null%0A      - tags             = {} -> null%0A      - tags_all         = {} -> null%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # aws_iam_policy.rds_management_policy will be destroyed%0A  # (because aws_iam_policy.rds_management_policy is not in configuration)%0A  - resource "aws_iam_policy" "rds_management_policy" {%0A      - arn              = "arn:aws:iam::471112990651:policy/rds-management-policy" -> null%0A      - attachment_count = 1 -> null%0A      - description      = "Policy to manage RDS instances" -> null%0A      - id               = "arn:aws:iam::471112990651:policy/rds-management-policy" -> null%0A      - name             = "rds-management-policy" -> null%0A      - path             = "/" -> null%0A      - policy           = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action   = [%0A                          - "rds:DescribeDBInstances",%0A                          - "rds: StopDBInstance",%0A                          - "rds: StartDBInstance",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = "*"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - policy_id        = "ANPAW3MEFX652XFQDBRBG" -> null%0A      - tags             = {} -> null%0A      - tags_all         = {} -> null%0A        # (1 unchanged attribute hidden)%0A    }%0A%0A  # aws_iam_role.lambda_role will be destroyed%0A  # (because aws_iam_role.lambda_role is not in configuration)%0A  - resource "aws_iam_role" "lambda_role" {%0A      - arn                   = "arn:aws:iam::471112990651:role/algosolved-lambda-role" -> null%0A      - assume_role_policy    = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "sts:AssumeRole"%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - Service = "lambda.amazonaws.com"%0A                        }%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> null%0A      - create_date           = "2024-05-14T14:58:10Z" -> null%0A      - force_detach_policies = false -> null%0A      - id                    = "algosolved-lambda-role" -> null%0A      - managed_policy_arns   = [%0A          - "arn:aws:iam::471112990651:policy/autoscaling-management-policy",%0A          - "arn:aws:iam::471112990651:policy/rds-management-policy",%0A        ] -> null%0A      - max_session_duration  = 3600 -> null%0A      - name                  = "algosolved-lambda-role" -> null%0A      - path                  = "/" -> null%0A      - tags                  = {} -> null%0A      - tags_all              = {} -> null%0A      - unique_id             = "AROAW3MEFX65ZT3NCLPLA" -> null%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # aws_iam_role_policy_attachment.asg_policy_attachment will be destroyed%0A  # (because aws_iam_role_policy_attachment.asg_policy_attachment is not in configuration)%0A  - resource "aws_iam_role_policy_attachment" "asg_policy_attachment" {%0A      - id         = "algosolved-lambda-role-20240514145856309600000001" -> null%0A      - policy_arn = "arn:aws:iam::471112990651:policy/autoscaling-management-policy" -> null%0A      - role       = "algosolved-lambda-role" -> null%0A    }%0A%0A  # aws_iam_role_policy_attachment.rds_policy_attachment will be destroyed%0A  # (because aws_iam_role_policy_attachment.rds_policy_attachment is not in configuration)%0A  - resource "aws_iam_role_policy_attachment" "rds_policy_attachment" {%0A      - id         = "algosolved-lambda-role-20240514145946165200000001" -> null%0A      - policy_arn = "arn:aws:iam::471112990651:policy/rds-management-policy" -> null%0A      - role       = "algosolved-lambda-role" -> null%0A    }%0A%0A  # aws_lb.algosolved-lb will be created%0A  + resource "aws_lb" "algosolved-lb" {%0A      + arn                                                          = (known after apply)%0A      + arn_suffix                                                   = (known after apply)%0A      + client_keep_alive                                            = 3600%0A      + desync_mitigation_mode                                       = "defensive"%0A      + dns_name                                                     = (known after apply)%0A      + drop_invalid_header_fields                                   = false%0A      + enable_deletion_protection                                   = false%0A      + enable_http2                                                 = true%0A      + enable_tls_version_and_cipher_suite_headers                  = false%0A      + enable_waf_fail_open                                         = false%0A      + enable_xff_client_port                                       = false%0A      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)%0A      + id                                                           = (known after apply)%0A      + idle_timeout                                                 = 120%0A      + internal                                                     = (known after apply)%0A      + ip_address_type                                              = "ipv4"%0A      + load_balancer_type                                           = "application"%0A      + name                                                         = "algosolved-alb"%0A      + name_prefix                                                  = (known after apply)%0A      + preserve_host_header                                         = false%0A      + security_groups                                              = [%0A          + "sg-00c0a6b6c9e473ec0",%0A        ]%0A      + subnets                                                      = [%0A          + "subnet-02a53b7890c322346",%0A          + "subnet-048b8c0b0d0c912b2",%0A          + "subnet-05c85f1be65b09802",%0A          + "subnet-06c7c601881a79996",%0A        ]%0A      + tags                                                         = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all                                                     = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + vpc_id                                                       = (known after apply)%0A      + xff_header_processing_mode                                   = "append"%0A      + zone_id                                                      = (known after apply)%0A%0A      + timeouts {}%0A    }%0A%0A  # aws_lb_target_group.algosolved-lb-tg will be created%0A  + resource "aws_lb_target_group" "algosolved-lb-tg" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = (known after apply)%0A      + deregistration_delay               = "15"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancer_arns                 = (known after apply)%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + load_balancing_anomaly_mitigation  = (known after apply)%0A      + load_balancing_cross_zone_enabled  = (known after apply)%0A      + name                               = "algosolved-ec2-target-group"%0A      + name_prefix                        = (known after apply)%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags                               = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all                           = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + target_type                        = "instance"%0A      + vpc_id                             = "vpc-0f87a26ea18c1b807"%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 2%0A          + interval            = 30%0A          + matcher             = "200"%0A          + path                = "/api/health/ping"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 10%0A          + unhealthy_threshold = 10%0A        }%0A    }%0A%0APlan: 4 to add, 2 to change, 5 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 2024-05-21T16:09:57.376Z [INFO]  Terraform version: 1.8.1%0A2024-05-21T16:09:57.377Z [INFO]  Go runtime version: go1.22.1%0A2024-05-21T16:09:57.377Z [INFO]  CLI args: []string{"/home/runner/work/_temp/95bed2a6-40a7-49d7-8911-54fea2d071b5/terraform-bin", "plan", "-no-color"}%0A2024-05-21T16:09:57.377Z [INFO]  CLI command args: []string{"plan", "-no-color"}%0A2024-05-21T16:09:57.383Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=fce1b558-7cc1-5cf9-7971-170fe49a7aa6 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials%0A2024-05-21T16:09:58.121Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=fce1b558-7cc1-5cf9-7971-170fe49a7aa6 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-21T16:09:58.304Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=fce1b558-7cc1-5cf9-7971-170fe49a7aa6 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-21T16:09:58.640Z [INFO]  backend/local: starting Plan operation%0A2024-05-21T16:09:59.256Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=802ff5fa-4b68-6d0a-6fc3-b6900da71001 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-21T16:09:59.638Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-21T16:09:59.733Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-21T16:09:59.733Z%0A2024-05-21T16:10:00.373Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-21T16:10:00.465Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-21T16:10:00.465Z%0A2024-05-21T16:10:00.588Z [INFO]  backend/local: plan calling Plan%0A2024-05-21T16:10:00.595Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-21T16:10:00.682Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: configuring server automatic mTLS: timestamp=2024-05-21T16:10:00.682Z%0A2024-05-21T16:10:00.793Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved credentials: tf_aws.credentials_source=EnvConfigCredentials tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 @module=aws.aws-base tf_req_id=3cdaaa79-5f7b-9480-0ebf-ef7fb6d0132d tf_rpc=ConfigureProvider timestamp=2024-05-21T16:10:00.793Z%0A2024-05-21T16:10:01.508Z [INFO]  provider.terraform-provider-aws_v5.46.0_x5: Retrieved caller identity from STS: tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.52/logging/tf_logger.go:39 @module=aws.aws-base tf_req_id=3cdaaa79-5f7b-9480-0ebf-ef7fb6d0132d tf_rpc=ConfigureProvider timestamp=2024-05-21T16:10:01.508Z%0A2024-05-21T16:10:01.523Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lb_target_group.algosolved-lb-tg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .lambda_multi_value_headers_enabled: planned value cty.False for a non-computed attribute%0A      - .target_type: planned value cty.StringVal("instance") for a non-computed attribute%0A      - .proxy_protocol_v2: planned value cty.False for a non-computed attribute%0A      - .slow_start: planned value cty.NumberIntVal(0) for a non-computed attribute%0A      - .health_check[0].enabled: planned value cty.True for a non-computed attribute%0A      - .health_check[0].protocol: planned value cty.StringVal("HTTP") for a non-computed attribute%0A      - .stickiness: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .target_failover: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A      - .target_health_state: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-21T16:10:01.757Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_policy.rds_management_policy during refresh.%0A      - .attachment_count: was cty.NumberIntVal(0), but now cty.NumberIntVal(1)%0A2024-05-21T16:10:01.762Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_policy.asg_management_policy during refresh.%0A      - .attachment_count: was cty.NumberIntVal(0), but now cty.NumberIntVal(1)%0A2024-05-21T16:10:01.792Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_iam_role.lambda_role during refresh.%0A      - .managed_policy_arns: actual set element cty.StringVal("arn:aws:iam::471112990651:policy/rds-management-policy") does not correlate with any element in plan%0A      - .managed_policy_arns: length changed from 1 to 2%0A2024-05-21T16:10:02.369Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-ec2-sg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute%0A2024-05-21T16:10:02.373Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lb.algosolved-lb, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .preserve_host_header: planned value cty.False for a non-computed attribute%0A      - .enable_deletion_protection: planned value cty.False for a non-computed attribute%0A      - .client_keep_alive: planned value cty.NumberIntVal(3600) for a non-computed attribute%0A      - .enable_http2: planned value cty.True for a non-computed attribute%0A      - .enable_tls_version_and_cipher_suite_headers: planned value cty.False for a non-computed attribute%0A      - .enable_waf_fail_open: planned value cty.False for a non-computed attribute%0A      - .xff_header_processing_mode: planned value cty.StringVal("append") for a non-computed attribute%0A      - .desync_mitigation_mode: planned value cty.StringVal("defensive") for a non-computed attribute%0A      - .enable_xff_client_port: planned value cty.False for a non-computed attribute%0A      - .drop_invalid_header_fields: planned value cty.False for a non-computed attribute%0A      - .subnet_mapping: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-21T16:10:02.380Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_alb_listener.algosolved-https-listener, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .mutual_authentication: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-21T16:10:02.381Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_alb_listener.algosolved-http-forward, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .default_action[0].redirect[0].host: planned value cty.StringVal("#{host}") for a non-computed attribute%0A      - .default_action[0].redirect[0].path: planned value cty.StringVal("/#{path}") for a non-computed attribute%0A      - .default_action[0].redirect[0].query: planned value cty.StringVal("#{query}") for a non-computed attribute%0A      - .mutual_authentication: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead%0A2024-05-21T16:10:02.554Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_ecr_repository.algosolved_repository during refresh.%0A      - .tags: was null, but now cty.MapValEmpty(cty.String)%0A2024-05-21T16:10:02.556Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute%0A      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A      - .encryption_configuration: block count in plan (1) disagrees with count in config (0)%0A      - .image_scanning_configuration: block count in plan (1) disagrees with count in config (0)%0A2024-05-21T16:10:03.203Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_launch_template.algosolved-lt during refresh.%0A      - .security_group_names: was null, but now cty.SetValEmpty(cty.String)%0A2024-05-21T16:10:03.212Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_launch_template.algosolved-lt, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .disable_api_termination: planned value cty.False for a non-computed attribute%0A      - .instance_initiated_shutdown_behavior: planned value cty.StringVal("") for a non-computed attribute%0A      - .ram_disk_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .user_data: planned value cty.StringVal("") for a non-computed attribute%0A      - .ebs_optimized: planned value cty.StringVal("") for a non-computed attribute%0A      - .security_group_names: planned value cty.SetValEmpty(cty.String) for a non-computed attribute%0A      - .disable_api_stop: planned value cty.False for a non-computed attribute%0A      - .kernel_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].virtual_name: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].no_device: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].ebs[0].delete_on_termination: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].ebs[0].encrypted: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].ebs[0].kms_key_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].ebs[0].snapshot_id: planned value cty.StringVal("") for a non-computed attribute%0A2024-05-21T16:10:04.077Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an unexpected new value for aws_autoscaling_group.algosolved-ec2-asg during refresh.%0A      - .enabled_metrics: was null, but now cty.SetValEmpty(cty.String)%0A      - .suspended_processes: was null, but now cty.SetValEmpty(cty.String)%0A      - .termination_policies: was null, but now cty.ListValEmpty(cty.String)%0A2024-05-21T16:10:04.086Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_autoscaling_group.algosolved-ec2-asg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .termination_policies: planned value cty.ListValEmpty(cty.String) for a non-computed attribute%0A      - .health_check_grace_period: planned value cty.NumberIntVal(300) for a non-computed attribute%0A      - .launch_configuration: planned value cty.StringVal("") for a non-computed attribute%0A      - .suspended_processes: planned value cty.SetValEmpty(cty.String) for a non-computed attribute%0A      - .target_group_arns: planned value cty.UnknownVal(cty.Set(cty.String)) does not match config value cty.SetVal([]cty.Value{cty.UnknownVal(cty.String)}) nor prior value cty.SetValEmpty(cty.String)%0A      - .default_instance_warmup: planned value cty.NumberIntVal(0) for a non-computed attribute%0A      - .placement_group: planned value cty.StringVal("") for a non-computed attribute%0A      - .context: planned value cty.StringVal("") for a non-computed attribute%0A      - .capacity_rebalance: planned value cty.False for a non-computed attribute%0A      - .max_instance_lifetime: planned value cty.NumberIntVal(0) for a non-computed attribute%0A      - .protect_from_scale_in: planned value cty.False for a non-computed attribute%0A      - .enabled_metrics: planned value cty.SetValEmpty(cty.String) for a non-computed attribute%0A      - .metrics_granularity: planned value cty.StringVal("1Minute") for a non-computed attribute%0A      - .wait_for_capacity_timeout: planned value cty.StringVal("10m") for a non-computed attribute%0A      - .desired_capacity_type: planned value cty.StringVal("") for a non-computed attribute%0A      - .force_delete: planned value cty.False for a non-computed attribute%0A      - .force_delete_warm_pool: planned value cty.False for a non-computed attribute%0A      - .ignore_failed_scaling_activities: planned value cty.False for a non-computed attribute%0A2024-05-21T16:10:04.100Z [INFO]  backend/local: plan operation completed%0A
::debug::exitcode: 0

```

</details>




**Pusher: @rha6780**